spcalendarpro.min.js

/*
* @name SPCalendarPro
<<<<<<< HEAD
* Version 1.2.1.1
=======
* Version 1.2.1
>>>>>>> 854d0bf85e9ad6b2ed1e6e9a7265268fb0fdc8a3
* No dependencies!
* @description An ultra lightweight JavaScript library to easily manage SharePoint calendar events.
* @category Plugins/SPCalendarPro
* @documentation https://spcalendarpro.sharepointhacks.com
* @author Sam Perrow sam.perrow399@gmail.com
*
* Copyright 2018  Sam Perrow  (email : sam.perrow399@gmail.com)
* Licensed under the MIT license:
* http://www.opensource.org/licenses/mit-license.php
*/

<<<<<<< HEAD
!function(e,t){e.spcalpro=function(){function e(e,t){return{begin:{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString()},end:{endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}}r.prototype.isSameDate=function(){var e=this.userDateTimes.begin.beginDate.toDateString(),t=this.userDateTimes.end.endDate.toDateString();return this.data.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t})},r.prototype.matchDateTimes=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.data.filter(function(r){return r.EventDate<=e&&r.EndDate>=t})},r.prototype.isTimeConflict=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.data.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a})},r.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(r+" ")[1],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.data.filter(function(e){return a[r](e[t],n)})};var t=function(e,t,r,n){var a=void 0===t.async||t.async,i="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+t.listName+"</listName>",s="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",o="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>",u="2010"===n.year?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query>":"<query><Query><Where><IsNull><FieldRef Name='fRecurrence'/></IsNull></Where></Query></query>",l="",c=t.fields?function(){for(var e='<FieldRef Name="fRecurrence"/>',r=0;r<t.fields.length;r++)e+="<FieldRef Name='"+t.fields[r]+"'/>";return e}():"";function p(r){var n;return 4==r.readyState&&200==r.status?function(t){{if(t.responseXML)return e.data=d(t.responseXML.querySelectorAll("*"));if(!t.responseXML&&t.responseText){var r=(n=t.responseText.replace(/&#22;|&#0;/g,""),window.ActiveXObject?new ActiveXObject("Microsoft.XMLDOM").loadXML(n):(new DOMParser).parseFromString(n,"application/xml"));return e.data=d(r.querySelectorAll("*"))}}var n}(r):500==r.status&&(n=r,e.error={errorCode:/<errorcode xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(n.responseText)?n.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0]:"",errorString:/<errorstring xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(n.responseText)?n.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0]:"",faultString:/<faultstring>/.test(n.responseText)?n.responseText.split("<faultstring>")[1].split("</faultstring>")[0]:""},console.error(e.error),e.error),t.callback?t.callback(e.data,e):e.userCallback?e.userCallback(e.data,e):e}function d(e){for(var r=[],n=0;n<e.length;n++){var a={},i=e[n].attributes;if("z:row"===e[n].nodeName){for(var s=0;s<i.length;s++){var o=i[s].name.split("ows_")[1];a[o]="EventDate"===o||"EndDate"===o?new Date(i[s].value.replace("-","/")):i[s].value}r.push(a)}}return t.getEventsAfterDate&&(r=r.filter(function(e){return e.EventDate>=t.getEventsAfterDate})),t.getEventsBeforeDate&&(r=r.filter(function(e){return e.EventDate<=t.getEventsBeforeDate})),r}return"calendar"===r?(l="single"===t.type?u:"recurring"===t.type?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>":"<query><Query><Where>"+s+o,l+="<viewFields><ViewFields>"+c+"</ViewFields></viewFields></GetListItems>"):"list"===r&&(t.whereCAMLQuery&&(l=t.whereCAMLQuery),l+="<viewFields><ViewFields>"+c+"</ViewFields></viewFields></GetListItems>"),function(e){var t=new XMLHttpRequest;{if(t.open("POST",n.soapURL,a),t.setRequestHeader("X-Requested-With","XMLHttpRequest"),t.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),t.send(e),!0!==a)return p(t);t.onload=function(){return p(t)}}}(i+l+"</soap:Body></soap:Envelope>"),e};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};function r(e,r){this.listName=e.listName,this.getEventsAfterDate=e.getEventsAfterDate?e.getEventsAfterDate:null,this.getEventsBeforeDate=e.getEventsBeforeDate?e.getEventsBeforeDate:null,this.fields=e.fields?e.fields:null,this.userDateTimes=e.userDateTimes?e.userDateTimes:null,this.whereCAMLQuery=e.whereCAMLQuery?e.whereCAMLQuery:null;var n,a,i=(n=e.sourceSite,{year:15===(a=_spPageContextInfo.webUIVersion)?"2013":"2010",soapURL:"string"==typeof n&&n.length>0?n+"/_vti_bin/Lists.asmx":15===a?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"});return this.ready=function(e){this.userCallback=e},this.callback=function(){return e.callback?e.callback(this):null},this.data=t(this,e,r,i),this}return{getCalendarEvents:function(e){return new r(e,"calendar")},getListItems:function(e){return new r(e,"list")},getDateTimesFromForm:function(t,r){var n=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}}(t,r);return e(n.userBeginDT,n.userEndDT)},provideDateTimes:function(t,r){return e(t,r)},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);
=======
!function(e,t){e.spcalpro=function(){function e(e,t){return{begin:{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString()},end:{endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}}r.prototype.isSameDate=function(){var e=this.userDateTimes.begin.beginDate,t=this.userDateTimes.end.endDate;return this.listData=this.listData.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t}),this},r.prototype.matchDateTimes=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.listData=this.listData.filter(function(r){return r.EventDate<=e&&r.EndDate>=t}),this},r.prototype.isTimeConflict=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.listData=this.listData.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a}),this},r.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(r+" ")[1],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.listData=this.listData.filter(function(e){return a[r](e[t],n)}),this};var t=function(e,t,r,n){var a=void 0===t.async||t.async,i="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+t.listName+"</listName>",s="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",o="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>",u="2010"===n.year?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query>":"<query><Query><Where><IsNull><FieldRef Name='fRecurrence'/></IsNull></Where></Query></query>",l="",c=t.fields?function(){for(var e='<FieldRef Name="fRecurrence"/>',r=0;r<t.fields.length;r++)e+="<FieldRef Name='"+t.fields[r]+"'/>";return e}():"";function p(r){var n;return 4==r.readyState&&200==r.status?function(t){{if(t.responseXML)return e.listData=m(t.responseXML.querySelectorAll("*"));if(!t.responseXML&&t.responseText){var r=(n=t.responseText.replace(/&#22;|&#0;/g,""),window.ActiveXObject?new ActiveXObject("Microsoft.XMLDOM").loadXML(n):(new DOMParser).parseFromString(n,"application/xml"));return e.listData=m(r.querySelectorAll("*"))}}var n}(r):500==r.status&&(n=r,e.error={errorCode:/<errorcode xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(n.responseText)?n.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0]:"NA",errorString:/<errorstring xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(n.responseText)?n.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0]:"NA",faultString:/<faultstring>/.test(n.responseText)?n.responseText.split("<faultstring>")[1].split("</faultstring>")[0]:"NA"},console.error(e.error),e.error),t.callback?t.callback(e.listData,e.error):e.userCallback?e.userCallback(e.listData,e.error):!0!==a||t.callback?e:void console.error("You must specify a callback method as a property value in the object.")}function m(e){for(var r=[],n=0;n<e.length;n++){var a={},i=e[n].attributes;if("z:row"===e[n].nodeName){for(var s=0;s<i.length;s++){var o=i[s].name.split("ows_")[1];a[o]="EventDate"===o||"EndDate"===o?new Date(i[s].value.replace("-","/")):i[s].value}r.push(a)}}return t.getEventsAfterDate&&(r=r.filter(function(e){return e.EventDate>=t.getEventsAfterDate})),t.getEventsBeforeDate&&(r=r.filter(function(e){return e.EventDate<=t.getEventsBeforeDate})),r}return"calendar"===r?(l="single"===t.type?u:"recurring"===t.type?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>":"<query><Query><Where>"+s+o,l+="<viewFields><ViewFields>"+c+"</ViewFields></viewFields></GetListItems>"):"list"===r&&(t.whereCAMLQuery&&(l=t.whereCAMLQuery),l+="<viewFields><ViewFields>"+c+"</ViewFields></viewFields></GetListItems>"),function(e){var t=new XMLHttpRequest;{if(t.open("POST",n.soapURL,a),t.setRequestHeader("X-Requested-With","XMLHttpRequest"),t.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),t.send(e),!0!==a)return p(t);t.onload=function(){return p(t)}}}(i+l+"</soap:Body></soap:Envelope>"),e};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};function r(e,r){this.listName=e.listName,this.getEventsAfterDate=e.getEventsAfterDate?e.getEventsAfterDate:null,this.getEventsBeforeDate=e.getEventsBeforeDate?e.getEventsBeforeDate:null,this.fields=e.fields?e.fields:null,this.userDateTimes=e.userDateTimes?e.userDateTimes:null,this.whereCAMLQuery=e.whereCAMLQuery?e.whereCAMLQuery:null;var n,a,i=(n=e.sourceSite,{year:15===(a=_spPageContextInfo.webUIVersion)?"2013":"2010",soapURL:"string"==typeof n&&n.length>0?n+"/_vti_bin/Lists.asmx":15===a?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"});return this.ready=function(e){this.userCallback=e},this.callback=function(){return e.callback?e.callback(this):null},this.listData=t(this,e,r,i),this.listData}return{getCalendarEvents:function(e){return new r(e,"calendar")},getListItems:function(e){return new r(e,"list")},getDateTimesFromForm:function(t,r){var n=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}}(t,r);return e(n.userBeginDT,n.userEndDT)},provideDateTimes:function(t,r){return e(t,r)},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);
>>>>>>> 854d0bf85e9ad6b2ed1e6e9a7265268fb0fdc8a3
